
{ "happys": [{
    "title": "Cherishing Others",
    "author": "Geshe Kelsang Gyatso",
    "article": "All living beings deserve to be cherished because of the tremendous kindness they have shown us. All our temporary and ultimate happiness arises through their kindness. Even our body is the result of the kindness of others. We did not bring it with us from our previous life – it developed from the union of our father’s sperm and mother’s ovum. Once we had been conceived our mother kindly allowed us to stay in her womb, nourishing our body with her blood and warmth, putting up with great discomfort, and finally going through the painful ordeal of childbirth for our sake. We came into this world naked and empty-handed and were immediately given a home, food, clothes, and everything else we needed. While we were a helpless baby our mother protected us from danger, fed us, cleaned us, and loved us. Without her kindness we would not be alive today. Through receiving a constant supply of food, drink, and care, our body gradually grew from that of a tiny helpless baby to the body we have now. All this nourishment was directly or indirectly provided by countless living beings. Every cell of our body is therefore the result of others’ kindness. Even those who have never known their mother have received nourishment and loving care from other people. The mere fact that we are alive today is a testimony to the great kindness of others.",
    "image": "https://images-na.ssl-images-amazon.com/images/I/81HZ238G3yL.jpg"
    }, {
    "title": "Transforming our life into the Quick Path: Changing our mind with the Dharma",
    "author": "Ryan Engen",
    "article": "The final aspect of being a good example of a Kadampa is using the Dharma to change our mind.  At our stage of development, we can say there are two main ways we use the Dharma to change our mind.  The first is we use it to overcome our attachment to the eight worldly concerns, and second we use it to solve our daily problems.  These will now each be explained. “…of changing our own mind with the Dharma.” Dharma practice is the process of changing the habits of our mind.  If we are not changing our mind, we are not practicing the Dharma, no matter how much Dharma we may know.  If we are sincerely changing our mind, we are a qualified yogi even if we only know one or two lines of Dharma.  We need to make a point of overcoming the 8 worldly concerns.  The first two are attachment to pleasant feelings and aversion to unpleasant feelings.  What is pleasant depends on what you pay attention to.  For example, if we pay attention to the taste, broccoli may seem bad; but if we pay attention to how good it is for our health, we will enjoy eating it.  Gen-la Khyenrab says we need to live our life from perspective of our aggregate of discrimination, not our aggregate of feeling.  It doesn’t matter what we are feeling, it only matters how we are choosing to respond to it.  So much of the spiritual life can be summed up with the phrase “it doesn’t matter, quit whining and get on with it”.  The next two worldly concerns are attachment to praise and aversion to blame.  If we understand emptiness, we can cut this very quickly by recalling that in reality there is nobody there saying anything or thinking anything about us.  There is just the appearance of somebody there saying of thinking something.  What others say is just karmic echo of what you said about others in the past.  If we receive praise, we should direct it all to the guru at our heart and to the purity of the mind of the other person.  If we enjoy praise, then we will suffer from criticism.  We should use praise and blame to help us identify our delusions and faults.  The correct response to somebody criticizing us should be “thank you for helping me see that in myself.  I certainly don’t want to be like that!”  At the end of the day, praise and blame make no difference on our deathbed, so why should we worry about it now? The next two worldly concerns are attachment to a good reputation and aversion to a bad reputation.  Again, we can recall that there is nobody there thinking anything, there is just the appearance of somebody there thinking something.  In reality, they are just a karmic echo of what we have thought about others in the past.  When it appears others think badly of us, we should recall this and use it to reinforce our determination to think only good things about others now.  In modern times, there is so much suffering that arises from trying to manage what other people think.  If we realize it does not matter, we can let go of so much suffering.  Even from a conventional point of view, what others think depends upon their mind, not ours.  So it is their problem.  What they think is a reflection of their own mind, so it should not affect us.  We can be concerned about it as it relates to the flourishing of Dharma, but we should never be attached to it. The final two worldly concerns are attachment to gain and aversion to loss.  What is there to gain, what is there to lose?  Nothing.  There is nothing there, there is nothing to gain, there is nothing to lose and there isn’t even an us.  It is a karmic light show, nothing more.  In the end, gain and loss depend on what you are trying to accomplish.  If we are trying to train our mind, then all things equally lead to a gain.  It is only when we want to accomplish goals other than training our mind that things become “good” or “bad.”  Shakespere said in Hamlet, “Things are neither good nor bad, but thinking makes them so.”  This is very true.  For myself, I deal with almost all of my either worldly concerns through reliance on Dorje Shugden.  His job is to arrange what is best for my practice.  So I simply request, “with respect to X, if it is best, please arrange; if not, please sabotage it.”  After this request, I can then know that no matter what happens, it is for the best.  So I can accept it, be happy and get on with training my mind in the situation. The second way we can change our mind with the Dharma is we can use it to overcome our problems.  Geshe-la gives the example of our car breaking down.  Normally, we say, “I have a problem, my car broke down.”  But the car breaking down is the car’s problem, not ours.  Our problem is the unpleasant feeling which arises in our mind as a result.  If we want to fix the car’s problem, we take it to the mechanic.  If we want to fix our problem, we need to change our mind by learning how to respond differently to the situation.  Gen-la Dekyong took this example one step further by saying when we think about it the car can’t have a problem either because it is an inanimate object, and how can an inanimate object have a problem.  So in reality, there is neither an inner problem nor an outer problem! We can say there is an evolution of how to resolve problems.  Ordinary being exclusively try make changes on side of object.  When we have some Dharma wisdom, we pursue a mixed strategy where we change things on the side of object to the extent that we can, and then we change the rest on the side of our mind.  Geshe-la gives the example of having a headache.  We take the aspirin, but then we patiently accept the suffering as purification until the aspirin kicks in.   Through training in this way, gradually our capacity to transform suffering into purification increases and we are able to accept more and more suffering without it being a problem for us.  Where in the past, we may have taken the aspirin at the first available opportunity, we later don’t want to take it because for us we would rather have the opportunity to purify than to have the headache go away.  Eventually, we reach the point where we can change everything with the power of our mind alone.  We spontaneously perceive every object as perfect on side of object because our mind spontaneously responds perfectly to whatever arises.  A pure mind experiences a pure world.",
    "image": "https://meditatoninmadison.files.wordpress.com/2016/01/quick-path-banner-1200x525.jpg"
    }, {
    "title": "Though it appears, it is not other than emptiness",
    "author": "Ryan Engen",
    "article": "The Kadampa lineage is a wisdom lineage where we place primary emphasis on gaining wisdom, in particular the wisdom realizing emptiness.  All of our suffering is the karmic result of contaminated actions.  What makes an action contaminated is it is engaged in conjoined with the ignorance grasping at inherent existence of ourself, others and everything around us.  Self-grasping is the root of all delusions and delusions are the root of all contaminated actions.  If we can cut our self-grasping ignorance, all delusions will subside, we will cease engaging in contaminated actions and therefore no longer experience any suffering.  The principal reason why we generate the ignorance of self-grasping is because contaminated appearances appear to our mind – in other words, we think things exist from their own side, independent of mind, because that is how they appear.  When contamianted karma ripens, it ripens in the form of contamianted appearance.  Due to ignorance and mental habit we then believe these appearances to be true.  When we do this, we generate delusions such as attachment and aversion, and on that basis we engage in contaminated and negative actions which then plant new contaminated seeds on our mind which will ripen in the future as contaminated appearance and suffering.  The weak link of this cycle is when we mentally assent to the appearance of things existing inherently.  If we can change our conception at this stage then we can break the vicious cycle of samsara. Samsara is the world created by our ignorance, nirvana is the world created by our wisdom.  The difference between liberation and enlightenment is when we attain liberation we attain a permanent cessation of all delusions.  Since no delusions arise in our mind, we do not inadvertently activate contaminated karmic seeds on our mind, thus contaminated appearance does not arise at all.  We abide eternally in the clear light bliss of nirvana.  When we attain enlightenment, we not only cease all delusions, but we also purify our very subtle mind of all past contaminated karmic imprints.  Removing these contaminated imprints makes our mind omniscient and gives us the ability to emanate countless forms for the benefit of countless living beings.  In other words, we can emanate countless forms for living beings without ever leaving the absorbtion on the Dharmakaya.  Our emanations and our Dharmakaya are the same entity, just two different aspects.  Of all the meditations on the Kadampa path, the supreme is the Mahamudra meditations motivated by bodhichitta.  The Mahamudra meditations are actually quite simple:  we change our conception of the entity of an object.  At present, our view is that conventional objects are the same entity as their inherent existence.  Gold and the gold coin are the same entity, meaning you cannot take away the gold and still have the coin.  The gold coin is “made of” the gold.  In the same way, our ignorance sees objects, such as a table, as being the same entity as its inherent existence.  The table seems to be “made of” inherently existent stuff.  More specifically, we see the inherent existence of the table appearing in the aspect of a table.  With the Mahamudra meditations we change our conception of the entity.  Instead of conceiving the table as being the same nature (or same entity) as its inherent existence we choose to conceive of the table as being the same nature (or same entity) as its emptiness.  The emptiness of the table is appearing in the aspect of the table.  In both situations, there is still an appearance of an inherently existent table, but the difference is with the Mahamudra meditation we see that appearance as a manifestation of its own emptiness. When we do this, instead of seeing the table as something inherently existent, we will understand it to be the play of emptiness.  Actors assume forms and put on plays, in the same way, emptiness assumes forms and puts on the play of our karma.  We will understand that though things appear, they are not other than emptiness.  Our entire reality will be understood by us as our karmic dream created by mind emerging out of emptiness. The difference between Sutra Mahamudra and Vajrayana Mahamudra is instead of conceiving of objects as manifestations of their emptiness, we see objects as manifestations of our mind of great bliss, which itself is empty.  Milarepa said things are the nature of mind and mind is the nature of emptiness.  This explains Vajrayana Mahamudra.    When Milarepa said things are the nature of the mind, his definitive meaning is they are the nature of our mind of great bliss.  “Nature” in a Dharma context means “made of.”  The nature of the coin is gold, the nature of the statue is marble.  In the same way, the nature of all things is our mind of great bliss.  But this mind is itself empty.  So we take the Sutra Mahamudra understanding of the very subtle mind of great bliss is by nature emptiness (it is emptiness in the aspect of our very subtle mind of great bliss), and that this union of great bliss and emptiness assumes the aspect of the various forms we see.  So all things are the nature of the emptiness of our very subtle mind of great bliss.  Put simply, in samsara we uncontrolledly conceive of objects as being the same entity as their inherent existence.  In Sutra Mahamudra we choose to conceive of objects as being the same entity as their emptiness.  In Vajrayana Mahamudra we choose to conceive of objects as being the same entity as the emptiness of our mind of great bliss.  Practically speaking, what happens when we do this?  First, there is no basis for us to generate delusions with respect to appearances because we see them for what they are, a mere karmic dream with no true existence at all.  Second, by focusing on the empty nature of an object (seeing an object to be the same entity as its emptiness), this functions to cause the object to gather and dissolve back into its emptiness, much like a cloud gathering and dissolving back into the sky.  This causes the contaminated appearance to subside completely and we can enjoy the blissful peace of the clear light.  Third, this meditation functions to purify our very subtle mind of the contaminated karmic imprints which give rise t the contaminated appearance in the first place.  How does this work?  When we say an object is the same entity as its emptiness, what we are really saying is the object and its emptiness are two aspects of the same thing.  When we focus on the emptiness aspect of an object while not forgetting it is the same entity as the object itself, it functions to purify the contaminated imprint giving rise to the appearance.  It is a bit like ironing a wrinkle on the fabric of our mind, leaving it smooth and perfectly clear.  Fourth, when we add the conception that it is the emptiness of our mind of great bliss appearing in the aspect of the object, when we connet with the emptiness aspect of the object as before, when the contaminated appearance gathers and dissolves into emptiness we will expereience this absorbtion like a pocket of great bliss being released into the vast expanse of our mind.  Like there was great bliss trapped inside the object, but when the object was returned to its true nature this bliss was released into the expanse of our mind and we experience this absorbtion as the release of great bliss.  This feeling of release is why great bliss is sometimes described as orgasmic.  But the difference is great bliss is a feeling of supreme inner peace that is so peaceful it is blissful.  When we engage in Mahamudra meditations, our object is all phenomena gathered and dissolved into the blissful clear light mind realizing directly the equal emptiness of all phenomena.  We then abide in this blissful emptiness.  When conventional forms appear uncontrolledly, which they will inevitably do, we can correctly conceive of them as the pollution of our Dharmakaya.  We then identify how the conventional form appears to be the same entity as its inherent existence.  We then recall how this is mistaken appearance and that in reality it is the same entity as our mind of great bliss, which itself is empty.  So we dissolve the object first into our mind of clear light great bliss.  We then recall how this mind of clear light is itself the same entiy as its emptiness.  We then rest once againin this blissful emptiness.  Why will conventional forms appear to disturb our meditation on the clear light?  Because our winds escape from our central channel.  If we can keep our winds gathered and absorbed in our central channel, then it will cause our very subtle mind of great bliss to become manifest, and it will be impossible for conventional forms to appear.  We then meditate on the emptiness of this mind, recognizing it as the equal bliss and emptiness of all phenomena.  This meditation functions to purify all of our contamianted karmic imprints very quickly, leading to the state of enlightenment very quickly.  In our generation stage meditation, one of our recognitions is that though the self-generation appears it is not other than emptiness.  The meaning here is we are to see the self-generation as being the same entity as our mind of bliss and emptiness.  It is our mind of bliss and emptiness appearing in the aspect of the self-generation.  Instead of seeing our self-generation as being inherently existent, we see it as a pure creation of the mind.  We experience it as if we have put our mind of clear light into the shape or aspect or posture of the self-generation.  A true mental yoga.  We can then also carry this experience into the meditation break, viewing all objects as manifestions of bliss and emptiness.  We can view all things as, in fact, emanations of the Dharmakaya.  Each emanation is the same entity as its underlyling clear light emptiness which is our Truth Body.",
    "image": "http://www.startupsecrets.com/wp-content/uploads/mirage.jpg"
      }]
    }
